#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=326d34b1-dab1-4ff5-b654-17ea94d953a3]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=65e27ba6-357d-4949-a3d5-5224d0bcc39e]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=eaab743b-ca5e-4d11-9c9c-f9acbe4cfd18]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=34c06b19-13b1-401f-8be0-b01d86bdead5]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3141f00c-62f1-4e69-b079-5af3c72d3544]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=58107528-7fc6-441f-aef4-7f8fd52bbe3b]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=54145368-d807-4edb-92bc-0c262b040d6e]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ff4b484-25ce-4a9d-b2cd-cef618846d0d]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b7e48458-fd2a-4dd7-a07f-606ba16a6ef2]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=71945a67-2bb6-44ce-9a88-6df9d05f14af]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=111cbd3a-93b6-4663-add5-26189645bb2f]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5a88a401-584d-4d51-914f-ca95b639616d]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ae175926-b10c-4e1e-b0d1-dca7d45e5af1]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=202223a0-a71a-43df-b86e-d8a0e19603b6]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d24ad71d-4a12-4c7c-abd0-45d51729bb9e]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a3dd3dbe-84af-41aa-aa94-15eb4d4d7dbb]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b5b248c8-6436-4bf4-9ccb-6f4c98a9f3f3]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a9e79da-e1da-4dfd-a7d7-336cdefe91a1]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=18ac95f7-15d8-426d-a2f8-74aef2c9833a]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b1760613-7407-4477-871e-053f4f9d7839]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=841821f9-723c-47bb-a56c-91785f1fade6]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2c8e3863-a54f-46bc-8f6d-4ecfcaeb990f]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c8b41020-8a62-4f74-9ef8-7abe7382be9c]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=29dec5b5-219d-4af6-8187-e080408d2a84]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=cf0bf898-3b2c-478a-b982-6438903cd81e]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=231b5274-9ee2-44b7-bd32-08ec51a9a1ce]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d2db8c4e-c50b-4761-93ce-42c28cb8b813]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=77ca376e-b61f-41b3-8000-0d03647b00ff]
module.keycloak_dev.module.onestopauth.module.client_firstproject-13.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e0436fb4-c45d-4861-8662-6e778cda44d0]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6a455955-558a-4a9b-b4f9-244792055a25]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c03015ab-3612-4e49-8129-1d9036d99cf4]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1445a013-c23c-467f-8264-28a36387e9c6]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=57933b07-9c45-4129-b9f0-46f1d910e1c8]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d463262b-4b9a-4aa2-bace-6b58abea7093]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a492ac28-fa52-4d5f-9505-8b1f100a4dda]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=306160cd-a478-4c56-b164-e4c00fd957f3]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c31fd301-394d-4828-bd45-ec0751004103]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56200527-3909-4c02-b468-5f91156755fc]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b29956ba-4dd8-43b6-990a-e2a81528b92d]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=383fe8ea-de3a-4915-a52f-860fbf1bbe80]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e29049d5-4b73-4393-8317-3d6345954adb]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5514c7ef-d293-4ea1-bbf6-c49a334bd192]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b02dc5ec-a1b7-4c26-8e2f-2e41b8f3ffe4]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75d8ac36-8156-47d3-b890-97682124dc7c]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ef330158-03fc-4eab-8631-5e3297e13e43]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a5ceda21-fbcc-40e0-ab5d-97a08df2305f]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=afeb995f-a519-4f19-a10b-cde7e1a40803]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=140e35d9-4536-472a-a440-2abdd0822d11]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=89161301-45c5-4d41-860a-7315549335a8]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1c9722ca-e1f1-4cd4-8e80-c55f3ef363da]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d00fe817-e89f-43b8-aeaa-4b3379ac0b29]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c6ffacca-6e07-465c-a0f0-fca71212fb2b]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=31ce7dc9-f930-421f-a93e-86a0c0ead613]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ce64810e-6740-4136-ad48-1efaa4cec400]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=108b383c-6a05-471d-8b76-e56e87daf705]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=41f22b9b-9305-4134-b9d3-577ab2ee5c36]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2754a134-2436-4df3-9991-cd3995d8be8e]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6ae4238c-7875-4cea-83a5-e012e41d5abf]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b4350ce6-d058-4b02-a4b0-60e6f86a00f6]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1775a638-9680-406a-8df3-15a50561c576]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6b2e540e-e608-4ba2-972a-5c5c22160e75]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=51762d91-17d0-4241-b7f8-76a232fa5f1c]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b2e14e97-3052-40d3-8fde-08835d204b00]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6f4f15f0-7ed1-475b-96b7-2844caa95ddb]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=57c8af07-ff9e-44b4-9a46-859fd9ed2d3d]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2d4abba1-e3d4-46d9-b1d3-81165487843d]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5e8e4bfe-cb23-4beb-b67c-da0f2d899dbc]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=df1a6a6b-dd34-4327-9687-eec012f687e0]
module.keycloak_dev.module.onestopauth.module.client_mysamplerequest-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3c7e5dd2-9fd9-4ded-8904-136da66c0fb7]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa0b6916-1bab-4a15-915b-c4374fb4ce91]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=cfdade9c-1e81-477e-9888-837846ce56c4]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=39470b38-aaa9-48e5-a6e6-4f66302fcad1]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=17a09474-dbcb-4bf6-9b37-82d8afd0d7d3]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=31a1cdaa-a51f-43dc-85cf-4c846931ce29]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7039c887-d63a-4a76-be19-3f1a676bfc4e]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9b1151fa-e4d2-4619-919f-e1e2723d077f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=cad7d7a8-a658-4e49-bb6c-5781a807e59e]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b8206f35-b055-4fba-ad25-1b128bf2f2dd]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bb19b5dc-0b4a-4d5d-aeba-faca6f18c0f2]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f260fa79-f324-4d31-8c34-61bdb9385023]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b46263c0-37c7-4d6d-bb80-11501602777d]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=51f4c792-44ac-4cf6-9d71-6f5e95fa7bbb]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6c2e5647-f1e4-481d-9f1b-4c4e8e759a79]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d78b6009-272c-4300-8c40-aed74d3d3eeb]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1144b98a-53a6-45b2-88be-37d1f4f8d883]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8a263f36-6a9e-4354-b081-a65307b6f5d4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=51ac4855-a9b3-4d95-a825-7ddaf2b870a3]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1ca2c8f-9b82-4912-a92e-dcf363b8623b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5bab5edc-0b34-4244-91cb-42c6055eb160]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=be2ffe35-4ddc-4218-abca-6c41252f1586]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b038e78a-e8f3-4fdd-924d-03472819501b]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=63344caa-d4b5-49f9-8da2-b3e04c3843d0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=285ebf48-8e15-4386-aed7-0147382d37f1]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=79020ce4-9230-43cd-a0a6-772954c1ec03]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2555485a-a51e-4c1b-abf3-a773e3691cfe]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c03a9088-6387-4054-9aef-6958773c7ed2]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a5152ade-230c-45b8-827c-ff12b3622924]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfe34f04-d971-435c-a908-342e2fdf567c]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a4c955c2-3eae-490d-af4f-a4db8d8f0ff2]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=624232c4-9a34-4c83-b103-21fddc209e2a]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=37d59f60-7b95-4afc-b3fc-437d7656cdd9]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=d9ea1689-ab66-4bdd-82d6-19e31007b2b5]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2ee40dce-26eb-4e2f-9e6c-f62a93b551d0]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=80e8d9cb-ee2e-4d47-8afd-a33691744f9b]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76c2b784-3a1f-402f-8443-979ad265f81a]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4361a63-3caa-4f6c-ace3-919d449fa6ff]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3378987d-b723-4617-beec-77a81337de78]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c86dff16-eaa8-40b7-a90d-4eca47a68f48]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c410a701-d3c9-424a-b6a8-2c1bf9c5f64e]
module.keycloak_dev.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=20145990-6a3b-48d5-8c99-99733194dee5]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "march-2-b-ce-id-non-prod-to-prod-6043"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "march-2-b-ce-id-non-prod-to-prod-6043"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "march-2-b-ce-id-non-prod-to-prod-6043"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "march-2-b-ce-id-non-prod-to-prod-6043"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:10004",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "march-2-b-ce-id-non-prod-to-prod-6043"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "march-2-b-ce-id-non-prod-to-prod-6043"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "march-2-b-ce-id-non-prod-to-prod-6043"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "march-2-b-ce-id-non-prod-to-prod-6043"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange123",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3609 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*